Table of Contents
 Class ConcreteMemberDataEc2
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Concrete member data Ec2
[OpenModelClass("CI.Services.MemberData.Concrete.Ec2.ConcreteMemberDataEc2,CI.ConcreteSetup")]
public class ConcreteMemberDataEc2 : ConcreteMemberData
Inheritance
object
OpenObject
OpenAttribute
ConcreteMemberData
ConcreteMemberDataEc2
Inherited Members
 ConcreteMemberData.MemberType
 ConcreteMemberData.TwoWaySlabType
 ConcreteMemberData.TimeAxis
 ConcreteMemberData.CalculationSetup
 OpenAttribute.Element
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ConcreteMemberDataEc2()
Constructor
public ConcreteMemberDataEc2()
Properties
 BeamData
Beam data
public BeamDataEc2 BeamData { get; set; }
Property Value
BeamDataEc2
 CoeffKxForWmax
coefficient kx to increase limited concrete crack - only Dutch NAD
public double CoeffKxForWmax { get; set; }
Property Value
double
 ColumnData
Column data
public ColumnDataEc2 ColumnData { get; set; }
Property Value
ColumnDataEc2
 CreepCoeffInfinity
Gets or sets the user defined creep coefficient in infinity. If null, then we calculate them.
public double CreepCoeffInfinity { get; set; }
Property Value
double
 CreepCoeffInfinityValue
type of creep coefficient
public InputValue CreepCoeffInfinityValue { get; set; }
Property Value
InputValue
 DeflectionRequirement
gets or set deflection requirement for deflection calculation
public DeflectionRequirementEc2 DeflectionRequirement { get; set; }
Property Value
DeflectionRequirementEc2
 ExposureClassesData
Exposure classes
public ExposureClassesDataEc2 ExposureClassesData { get; set; }
Property Value
ExposureClassesDataEc2
 MemberImportance
Gets or sets the member importance.
public MemberImportance MemberImportance { get; set; }
Property Value
MemberImportance
 RelativeHumidity
Gets or sets the surrounding relative humidity.
public double RelativeHumidity { get; set; }
Property Value
double
 Edit this page